Fiddles/2_SOAP_WS_using_ChannelFactory/EchoWithPost/Request.txt

POST http://127.0.0.1:51111/SOAPRESTDemo.svc/soap/ HTTP/1.1
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://tempuri.org/ISOAPRESTDemo/EchoWithPost"
Host: 127.0.0.1:51111
Content-Length: 182
Expect: 100-continue
Accept-Encoding: gzip, deflate

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><EchoWithPost xmlns="http://tempuri.org/"><message>Hello World!</message></EchoWithPost></s:Body></s:Envelope>