Fiddles/2_SOAP_WS_using_ChannelFactory/EchoWithGet/Request.txt

POST http://127.0.0.1:51111/SOAPRESTDemo.svc/soap/ HTTP/1.1
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://tempuri.org/ISOAPRESTDemo/EchoWithGet"
Host: 127.0.0.1:51111
Content-Length: 180
Expect: 100-continue
Accept-Encoding: gzip, deflate
Connection: Keep-Alive

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><EchoWithGet xmlns="http://tempuri.org/"><message>Hello World!</message></EchoWithGet></s:Body></s:Envelope>